{"data":{"site":{"siteMetadata":{"title":"My personal site"}},"markdownRemark":{"id":"e8643110-584e-5bce-bd69-8794c5ee8b4f","html":"<h2>December 30</h2>\n<p>Interesting discussion of using Recompose together with graphql Apollo Client:\n<a href=\"https://dev-blog.apollodata.com/simplify-your-react-components-with-apollo-and-recompose-8b9e302dea51\">Simplify your React components with Apollo and Recompose</a></p>\n<h2>December 20</h2>\n<p>I was listening to The Square and the Tower, by Niall Ferguson, when he started\nreading Robert Burns’s poem (which Google lists under its first line,\n“I Hae a Wife O’ My Ain”). I didn’t realize it was Ferguson himself who was narrating\nthe book, nor that he was Scottish, but when he started reading, and suddenly switched\nfrom a very proper RP to a delightful Scottish accent, with a charmingly rising inflection\nin the end of phrases (is it the <a href=\"https://en.wikipedia.org/wiki/High_rising_terminal\">high rising terminal</a>\nthat Wikipedia talks about?), I was completely fascinated. So much so that I made a\n<a href=\"https://youtu.be/iAFiPggIloU\">clipping</a>:</p>\n<h2>December 19</h2>\n<p><a href=\"https://github.com/shakyShane/egghead-redux-obs\">Repository</a> with the code for\nShane Osbourne’s redux-observable course on Egghead.</p>\n<p>Also, John Lindquist’s <a href=\"https://github.com/johnlindquist/react-rxjs-lessons\">repository</a>\nwith code for a course on React, Recompose, and RxJS.</p>\n<h2>December 18</h2>\n<p><a href=\"https://github.com/kentcdodds/advanced-react-patterns\">Course material for Kent C. Dodds’s course “Advanced React Component Patterns”</a>\n(course videos are behind a paywall on Egghead.io). There’s some pretty cool stuff here!</p>\n<h2>December 17</h2>\n<p>Memo to self:</p>\n<p>One of the companies I worked at used Cucumber.js for writing integration tests\nfor our frontend. The frontend was a single-page app that talked with the backend\nover a json api. That raised a question of how to fill in the database with the data\nneeded to render the appropriate interface that will be checked during the test,\nand how to orchestrate the testing steps between the backend and the frontend.\nFor that, we used <a href=\"https://github.com/fesor/behat-stepler\">behat-stepler</a>,\nwhich sends strings of Gherkin over to the backend, which in turn parses those strings,\ndoes what is asked of it, and sends back some data when finished. For example, if a test\nneeds a user with given characteristics to exist in the database, a line of Gherkin\ncan describe this user, the frontend can send this line to the backend, the backend\nwill create such user and send back his id to be used in further steps of the test.</p>\n<p>I thought that was ingenious. But it looks like <code class=\"language-text\">behat-stepler</code> did not really catch\non, and the project seems to be abandoned at the moment.</p>\n<h2>December 16</h2>\n<p>Andreas Antonopoulos has easily become my most favorite author/speaker of the year. I first\nheard him in the <a href=\"https://www.kevinrose.com/single-post/andreas-antonopolous\">Kevin Rose Show</a>\npodcast, purely by chance, and am now listening to his talks on YouTube. Incidentally,\nfrom his talk <a href=\"https://youtu.be/i_wOEL6dprg\">Fake News, Fake Money</a>, I learned that there\nhas been a recent monetary crisis in India. Andreas is alluding to it in another talk,\n<a href=\"https://youtu.be/ONvg9SbauMg\">The Stories We Tell about Money</a>, but since he was giving\nthat talk in India, the audience didn’t need him to spell it out for them, and laughed\nat the hint. I was mystified at what the joke was about.</p>\n<p>Anyway, I just love this guy! His energy, his intellectual freedom, his openness to the future,\nhis offhand disregard for authority, his attitude towards the internet that I think is very\ncharacteristic of its early adopters in the 90s strongly resonate with me.</p>\n<h2>December 10</h2>\n<p><a href=\"https://www.youtube.com/watch?v=zk2bVBZhmcc\">Introduction to Redux Observable</a> by a developer from Atlassian,\nwhere they apparently use redux-observable in production.</p>\n<p><a href=\"https://youtu.be/LqEtKyuyngs\">The Holberg Debate 2017: “Propaganda, Facts and Fake News”\nwith Julian Assange, John Pilger, and Jonathan Heawood</a>.\nPowerful stuff.</p>\n<h2>November 29</h2>\n<p><a href=\"https://github.com/norvig/pytudes\">Norvig’s Python programs to practice or demonstrate skills</a></p>\n<h2>November 26</h2>\n<p>Came across slides for the course <em>Software Studio</em>, about the lowly craft of web development, taught at MIT.</p>\n<p><a href=\"https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-170-software-studio-spring-2013/lecture-notes/\">Course page from 2013</a>\n<a href=\"https://stellar.mit.edu/S/course/6/fa16/6.170/materials.html\">Course page from 2016</a></p>\n<p>What’s curious, the 2013 course taught Ruby on Rails and SQL for backend development, while the 2016 course teaches Node and MongoDB. Also, a notable addition to the 2016 course is React (which just goes on to show how commonplace and inescapably default React has become; it truly is the new jQuery).</p>\n<p>I was, however, shocked by this slide (from the lecture notes on React):</p>\n<p><a href=\"https://i.imgur.com/inOTSKO_d.jpg?maxwidth=800\"><img src=\"https://imgur.com/inOTSKO.png\"></a></p>\n<p>Never has the phrase “the view in MVC” (which has since generally been retired anyway, because it’s not a fitting abstraction for thinking about React) been intended for use in the context of clients and servers; it has always intended to explain React’s place among other client-side MVWhatever frameworks.</p>\n<h2>November 22</h2>\n<p>A mostly disappointing 6-hour workshop on integrating Purescript into a JavaScript app by Hardy Jones\nfrom the last LambdaConf. Disappointing firstly because Hardy mercilessly slaughters the ample time\nhe is given, moves excruciatingly slow and demonstrates very little, and secondly because the interop\nbetween the Purescript and the JavaScript code looks rather ugly. As does the tooling:</p>\n<p><a href=\"https://www.youtube.com/watch?v=XbrBGxcZZYY\">part 1</a></p>\n<p>On the bright side, here’s an inspiring (albeit a very high-level) <a href=\"http://www.oredev.org/2017/sessions/purescript-tomorrows-javascript-today\">talk</a>\nabout Purescript by a well-spoken Brit from a recent conference in Sweden:</p>\n<p>Also, some <a href=\"https://reacttraining.com/patterns/\">free lectures on React Patterns</a> by React Training.</p>\n<h2>November 19</h2>\n<p>A <a href=\"https://stackoverflow.com/questions/39439653/events-vs-streams-vs-observables-vs-async-iterators/47214496#47214496\">nice explanation</a>\nof the differences between the push and the pull apis for consumption of async data by Google’s Domenic Denicola on Stack Overflow</p>\n<h2>November 15</h2>\n<p><a href=\"http://meetupfeed.com/react-talks-meetups-july-august-september-react-talks-digest-q3-2017/\">React meetup recordings from July, August, and September 2017</a></p>\n<h2>November 13</h2>\n<p>Spent a long time looking wistfully at this job opening at BBC:\n<a href=\"https://careershub.bbc.co.uk/members/modules/job/detail.php?record=20625\">Software Engineer (Web Developer)</a>\nto work with BBC Moscow team. What discouraged me is that they are looking for\nthe sole developer (so it seems like more of a grunt kind of work).</p>\n<p>What’s beautiful is that when this job opening announcement reached standard\nonline job boards (like <a href=\"https://hh.ru/vacancy/23422897\">Headhunters.ru</a>) it lost most\nof the details of its description.</p>\n<h2>November 11</h2>\n<p>Heard announcements of a couple of CS courses that will hopefully be freely available. These are:</p>\n<ul>\n<li><a href=\"https://cs50.github.io/web/\">Web programming with Python and JavaScript</a></li>\n<li><a href=\"https://cs50.github.io/games/\">Introduction to Game Development</a></li>\n</ul>\n<h2>November 8</h2>\n<p>From Berkeley Martinez (the author of <a href=\"https://github.com/BerkeleyTrue/react-redux-epic\">react-redux-epic</a>),\nan example of its use: a demo app called <a href=\"https://github.com/realworldreact/react-shoppe\">React Shoppe</a>. Check\nout branches that have rx in their names.</p>\n<h2>November 5</h2>\n<p>An interesting implementation of React app with Flux architecture using RxJS</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=Wh83qXOb03g\">The talk by Gil Mazuz from ReactNext 2016</a></li>\n<li><a href=\"https://github.com/giltig/rxfrf\">Boilerplate illustrating the ideas in the talk</a></li>\n<li><a href=\"https://github.com/omerts/RtC\">Sample app demoed during the talk</a></li>\n</ul>\n<h2>October 29</h2>\n<h3>PWA-related finds:</h3>\n<ul>\n<li><a href=\"https://infrequently.org/2017/10/can-you-afford-it-real-world-web-performance-budgets/\">Can you afford it?</a>,\na blog post by Alex Russell</li>\n<li><a href=\"https://github.com/mike-north/pwa-fundamentals\">Github repo for a workshop on building PWAs by Mike North and Steve Kinney</a></li>\n</ul>\n<h2>October 27</h2>\n<h3>ReasonML-related finds:</h3>\n<p>Workshop on ReasonML at ReactiveConf 2017</p>\n<ul>\n<li><a href=\"https://docs.google.com/presentation/d/17CxVRrdw20Mm--ewv4KwxfxTPPuhB8gkxBp98LRaIsM/edit#slide=id.g292747eae2_0_198\">Slides on Google Docs</a></li>\n<li><a href=\"https://gist.github.com/sgrove/a6474d26b77bbf29d19b66ad71527cc9\">Gist with simple language examples</a></li>\n<li><a href=\"https://github.com/sgrove/reactiveconf-2017-reasonml-workshop\">Sean Grove’s GitHub repo with React examples</a></li>\n</ul>\n<h2>October 22</h2>\n<h3>ReasonML-related finds:</h3>\n<ul>\n<li><a href=\"https://github.com/bassjacob/ylj-2017-workshop\">A workshop on ReasonML from Yow Lambda Jam 2017</a></li>\n<li><a href=\"https://github.com/FormidableLabs/seattlejsconf-app\">A React Native app by Formidable for SeattleJS conference, written in Reason</a></li>\n</ul>\n<h2>September 25</h2>\n<p>Two very cool videos on the recent developments in CSS (mostly on Flexbox and CSS grid):</p>\n<ol>\n<li>\n<p><a href=\"https://player.vimeo.com/video/209812549\">Revolutionize Your Page: Real Art Direction on the Web</a> by Jen Simmons</p>\n</li>\n<li>\n<p><a href=\"https://player.vimeo.com/video/212961112\">CSS Grid Layout</a> by Rachel Andrew</p>\n</li>\n</ol>","frontmatter":{"title":"2017","date":null}}},"pageContext":{"slug":"/diary/2017/"}}